src/Documents/ВозвратВОборотКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВозвратВОборотКодовМаркировки</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.Чек</xr:Item>
				<xr:Item>Document.КорректировкаРеализации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПервичныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварОплачен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокументаРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовСоответствия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаСоответствия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаСоответсвия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВозврата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВозвратов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.Чек</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварОплачен</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПервичногоДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПервичныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокументаРегистрации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДокументовСоответствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокументаСоответствия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокументаСоответсвия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/СтатусыДокументовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленЗапросGTIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноЗаполненGTIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолностьюЗаполненGTIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированаОтгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПервичныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КассовыйЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварныйЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможеннаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктУничтожения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыВозвратов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыВозвратов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратПриРозничнойРеализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПриДистанционномСпособе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекВозврата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ВозвратВОборотКодовМаркировки/Ext/ObjectModule.bsl
// Модуль документа Возврат в оборот кодов маркировки

// Модуль документа Списание кодов маркировки

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовПлатформа.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыДокументовМаркировки.Новый;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОсобенностьУчета) Тогда
		ОсобенностьУчета = МаркировкаТоваровСервер.ОсобенностьУчетаНоменклатуры(Товары.ВыгрузитьКолонку("Номенклатура"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Статус = Перечисления.СтатусыДокументовМаркировки.Новый;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		Если ТекущаяСтрока.ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее
			И НЕ ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеПервичногоДокумента) Тогда
			
			ВывестиСообщение(
				НСтр("ru = 'Товары. Строка %1: Необходимо заполнить наименование первичного документа.'"),
				ЭтотОбъект,
				"Товары[#].НаименованиеПервичногоДокумента",
				ТекущаяСтрока.НомерСтроки,
				Отказ,
				ТекущаяСтрока.НомерСтроки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МаркировкаТоваровСервер.НоменклатураСоответствуетОсобенностиУчета(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Переведем вид кода маркировки
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		ТекущаяСтрока.КодМаркировки = 
			МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(
				ТекущаяСтрока.КодМаркировки,,
				СтрНачинаетсяС(ТекущаяСтрока.КодМаркировки, "("));
		
	КонецЦикла;
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ Отказ Тогда
	//	РегистрыСведений.ЖурналСостояний.ЗаписьВЖурналСостояний(Ссылка, Статус);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЗаполненияОбъекта

Функция ОбработкаЗаполнения_Чек(ДанныеЗаполнения,
	ТекстЗаполнения,
	СтандартнаяОбработка = Истина) Экспорт
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Товары"
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Хозоперация <> Справочники.ХозОперации.ЧекНаВозврат Тогда
		ТекстСообщения = НСтр("ru = 'Возврат в оборот доступен только при вводе на основании чека возврата.'");
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ДанныеЗаполнения, ТекстСообщения);
	КонецЕсли;
	
	ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации;
	
	ЗаполнитьТабличнуюЧастьТоваровПоОснованию(
		ДанныеЗаполнения,
		Перечисления.ВидыПервичныхДокументов.КассовыйЧек,
		НСтр("ru = 'Чек на возврат'"));
	
	Возврат Истина;
	
КонецФункции

Функция ОбработкаЗаполнения_ВозвратОтПокупателя(ДанныеЗаполнения,
	ТекстЗаполнения,
	СтандартнаяОбработка = Истина) Экспорт
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Товары"
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации;
	
	ЗаполнитьТабличнуюЧастьТоваровПоОснованию(
		ДанныеЗаполнения,
		Перечисления.ВидыПервичныхДокументов.Прочее,
		НСтр("ru = 'Возврат от покупателя'"));
	
	Возврат Истина;
	
КонецФункции

Функция ОбработкаЗаполнения_КорректировкаРеализации(ДанныеЗаполнения,
	ТекстЗаполнения,
	СтандартнаяОбработка = Истина) Экспорт
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Товары"
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации;
	
	Товары.Очистить();
	
	ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее;
	НомерПервичногоДокумента = ДанныеЗаполнения.Номер;
	ДатаПервичногоДокумента = ДанныеЗаполнения.Дата;
	НаименованиеПервичногоДокумента = НСтр("ru = 'Корректировка реализации'");
	
	// Заполним ТЧ Товары только теми товарами, которые на уменьшение и не указаны коды
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	СтруктураПоиска.Вставить("Возврат", Истина);
	Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Товары Цикл
		
		// Проверим, что количество возвратов совпадает с количеством разницы
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
		НайденныеСтроки = ДанныеЗаполнения.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого ТекущаяСтрокаМаркировки Из НайденныеСтроки Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.КодМаркировки = ТекущаяСтрокаМаркировки.КодМаркировки;
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			Документы.ВозвратВОборотКодовМаркировки.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока);
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			
			НоваяСтрока.ВидПервичногоДокумента = ВидПервичногоДокумента;
			НоваяСтрока.НомерПервичногоДокумента = НомерПервичногоДокумента;
			НоваяСтрока.ДатаПервичногоДокумента = ДатаПервичногоДокумента;
			НоваяСтрока.НаименованиеПервичногоДокумента = НаименованиеПервичногоДокумента;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТабличнуюЧастьТоваровПоОснованию(Основание, ВидОснования, НаименованиеДокумента)
	
	Товары.Очистить();
	
	ВидПервичногоДокумента = ВидОснования;
	НомерПервичногоДокумента = Основание.Номер;
	ДатаПервичногоДокумента = Основание.Дата;
	НаименованиеПервичногоДокумента = НаименованиеДокумента;
	
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	
	// Найдем ноенклатуру, у которой не отсканировали код
	Для Каждого ТекущаяСтрока Из Основание.Товары Цикл
		
		//Если НЕ ТекущаяСтрока.Номенклатура.ТипНоменклатуры.ВедетсяМаркировка Тогда
		//	Продолжить;
		//КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
		
		НайденныеСтроки = Основание.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого ТекущаяМаркировка Из НайденныеСтроки Цикл
			
			НоваяСтрока = Товары.Добавить();
			
			НоваяСтрока.КодМаркировки = ТекущаяМаркировка.КодМаркировки;
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			Документы.ВозвратВОборотКодовМаркировки.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока);
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			
			НоваяСтрока.ВидПервичногоДокумента = ВидПервичногоДокумента;
			НоваяСтрока.НомерПервичногоДокумента = НомерПервичногоДокумента;
			НоваяСтрока.ДатаПервичногоДокумента = ДатаПервичногоДокумента;
			НоваяСтрока.НаименованиеПервичногоДокумента = НаименованиеПервичногоДокумента;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
